#ifndef __USDK_SINE_TABLE_H__
#define __USDK_SINE_TABLE_H__

#ifdef __cplusplus
extern "C" {
#endif

//---------------------------------------------------------------------------
// Include
//---------------------------------------------------------------------------

#include "usdk.basic.h"

//---------------------------------------------------------------------------
// Functions
//---------------------------------------------------------------------------

///< 查表法, 分辨率 0.35°
void getSinCos(_IN_ s16 Angle, _OUT_ f32* Sin, _OUT_ f32* Cos);

#ifdef __cplusplus
}
#endif

#endif